TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0C1104/driverlib/empty_driverlib_src/ti/driverlib/m0p/sysctl/dl_sysctl_mspm0l211x_l112x.h
    return (DL_SYSCTL_FCC_TRIG_CNT)(periods);
}

/**
 *  @brief  Enable Frequency Correction Loop (FCL) in Internal Resistor Mode
 *
 *  Once FCL is enable, it cannot be disabled by software. A BOOTRST is required.
 */
__STATIC_INLINE void DL_SYSCTL_enableSYSOSCFCL(void)
{
    SYSCTL->SOCLOCK.SYSOSCFCLCTL =
        (SYSCTL_SYSOSCFCLCTL_KEY_VALUE | SYSCTL_SYSOSCFCLCTL_SETUSEFCL_TRUE);
}

/**
 *  @brief  Enable write protection of selected SYSCTL registers
 *
 *  Protecting writes to configuration registers in SYSCTL can add a layer of
 *  robustness against unintended changes during runtime.
 *
 *  @note Does not protect all SYSCTL registers, see TRM for more detail.
 */
__STATIC_INLINE void DL_SYSCTL_enableWriteLock(void)
{
    SYSCTL->SOCLOCK.WRITELOCK = SYSCTL_WRITELOCK_ACTIVE_ENABLE;
}

/**
 *  @brief  Disable write protection of selected SYSCTL registers
 *
 *  Protecting writes to configuration registers in SYSCTL can add a layer of
 *  robustness against unintended changes during runtime.
 *
 *  @note Does not protect all SYSCTL registers, see TRM for more detail.
 */
__STATIC_INLINE void DL_SYSCTL_disableWriteLock(void)
{
    SYSCTL->SOCLOCK.WRITELOCK = SYSCTL_WRITELOCK_ACTIVE_DISABLE;
}

/**
 *  @brief  Sets operating mode of VBOOST (analog charge pump)
 *
 *  Active VBOOST circuitry is needed for COMP/OPA/GPAMP (if present on device).
 *  VBOOST has a startup time, so consider power consumption versus desired startup time.
 *
 *  @note Although VBOOST clock source is automatically managed, it is up to
 *  application software to ensure certain cases, or else ANACLKERR occurs.
 *  See VBOOST section of TRM for more details.
 *  @param[in] setting   One of @ref DL_SYSCTL_VBOOST.
 */
__STATIC_INLINE void DL_SYSCTL_setVBOOSTConfig(DL_SYSCTL_VBOOST setting)
{
    DL_Common_updateReg(&SYSCTL->SOCLOCK.GENCLKCFG, (uint32_t) setting,
        SYSCTL_GENCLKCFG_ANACPUMPCFG_MASK);
}

/**
 *  @brief  Gets operating mode of VBOOST (analog charge pump)
 *
 *  Active VBOOST circuitry is needed for COMP/OPA/GPAMP (if present on device).
 *  VBOOST has a startup time, so consider power consumption versus desired startup time.
 *
 *  @note Although VBOOST clock source is automatically managed, it is up to
 *  application software to ensure certain cases, or else ANACLKERR occurs.
 *  See VBOOST section of TRM for more details.
 *  @return One of @ref DL_SYSCTL_VBOOST.
 */
__STATIC_INLINE DL_SYSCTL_VBOOST DL_SYSCTL_getVBOOSTConfig(void)
{
    uint32_t setting =
        SYSCTL->SOCLOCK.GENCLKCFG & SYSCTL_GENCLKCFG_ANACPUMPCFG_MASK;

    return (DL_SYSCTL_VBOOST)(setting);
}

/**
 *  @brief  Return byte that was saved through SHUTDOWN
 *
 *  Shutdown memory persists beyond BOR, BOOTRST, and SYSRST.
 *
 *  @note Parity bits and parity fault checking is done by hardware.
 *
 *  @param[in] index   One of @ref DL_SYSCTL_SHUTDOWN_STORAGE_BYTE.
 *
 *  @return 8-bit value of Shutdown Storage Byte.
 */
__STATIC_INLINE uint8_t DL_SYSCTL_getShutdownStorageByte(
    DL_SYSCTL_SHUTDOWN_STORAGE_BYTE index)
{
    const volatile uint32_t *pReg = &SYSCTL->SOCLOCK.SHUTDNSTORE0;

    return (uint8_t)(
        *(pReg + (uint32_t) index) & SYSCTL_SHUTDNSTORE0_DATA_MASK);
}

/**
 *  @brief  Save a byte to SHUTDOWN memory
 *
 *  Shutdown memory persists beyond BOR, BOOTRST, and SYSRST.
 *
 *  @note Parity bits and parity fault checking is done by hardware.
 *
 *  @param[in] index   One of @ref DL_SYSCTL_SHUTDOWN_STORAGE_BYTE.
 *  @param[in] data    8-bit data to save in memory
 */
__STATIC_INLINE void DL_SYSCTL_setShutdownStorageByte(
    DL_SYSCTL_SHUTDOWN_STORAGE_BYTE index, uint8_t data)
{
    DL_Common_updateReg(&SYSCTL->SOCLOCK.SHUTDNSTORE0 + (uint32_t) index, data,
        SYSCTL_SHUTDNSTORE0_DATA_MASK);
}

/**
 *  @brief  Enable SHUTDOWN IO Release
 *
 *  After shutdown, IO is locked in previous state.
 *
 *  @note Release IO after re-configuring IO to their proper state.
 */
__STATIC_INLINE void DL_SYSCTL_releaseShutdownIO(void)
{
    SYSCTL->SOCLOCK.SHDNIOREL =
        (SYSCTL_SHDNIOREL_KEY_VALUE | SYSCTL_SHDNIOREL_RELEASE_TRUE);
}

/**
 *  @brief  Disable the reset functionality of the NRST pin
 *
 *  Disabling the NRST pin allows the pin to be configured as a GPIO.
 *  Once disabled, the reset functionality can only be re-enabled by a POR.
 *
 *  @note The register is write-only, so the EXRSTPIN register
 *        will always appear as "Disabled" in the debugger
 */
__STATIC_INLINE void DL_SYSCTL_disableNRSTPin(void)
{
    SYSCTL->SOCLOCK.EXRSTPIN =
        (SYSCTL_EXRSTPIN_KEY_VALUE | SYSCTL_EXRSTPIN_DISABLE_TRUE);
}

/**
 *  @brief  Disable Serial Wire Debug (SWD) functionality
 *
 *  SWD pins are enabled by default after cold start to allow a debug connection.
 *  It is possible to disable SWD on these pins to use for other functionality.
 *
 *  @post SWD is disabled, but pins must be re-configured separately.
 *
 *  @note Cannot debug the device after disabling SWD. Only re-enabled by POR.
 */
__STATIC_INLINE void DL_SYSCTL_disableSWD(void)
{
    SYSCTL->SOCLOCK.SWDCFG =
        (SYSCTL_SWDCFG_KEY_VALUE | SYSCTL_SWDCFG_DISABLE_TRUE);
}

/**
 *  @brief  Return byte that is stored in RSTCAUSE.
 *
 *  @return The cause of reset. One of @ref DL_SYSCTL_RESET_CAUSE
 */
__STATIC_INLINE DL_SYSCTL_RESET_CAUSE DL_SYSCTL_getResetCause(void)
{
    uint32_t resetCause = SYSCTL->SOCLOCK.RSTCAUSE & SYSCTL_RSTCAUSE_ID_MASK;

    return (DL_SYSCTL_RESET_CAUSE)(resetCause);
}

/**
 *  @brief     Set the HFXT startup time
 *
 * Specify the HFXT startup time in 64us resolution. If the HFCLK startup
 * monitor is enabled (HFCLKFLTCHK), HFXT will be checked after this time
 * expires.
 *
 *  @param[in]  startupTime  The HFXT startup time to set in ~64us steps.
 *                           Value between [0x0 (~0s), 0xFF (~16.32ms)].
 */
__STATIC_INLINE void DL_SYSCTL_setHFXTStartupTime(uint32_t startupTime)
{
    DL_Common_updateReg(&SYSCTL->SOCLOCK.HFCLKCLKCFG, startupTime,
        SYSCTL_HFCLKCLKCFG_HFXTTIME_MASK);
}

/**
 *  @brief   Get the HFXT startup time
 *
 *  @return  Returns the HFXT startup time in ~64us steps
 *
 *  @retval  Value between [0x0 (~0s), 0xFF (~16.32ms)]
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getHFXTStartupTime(void)
{
    return (SYSCTL->SOCLOCK.HFCLKCLKCFG & SYSCTL_HFCLKCLKCFG_HFXTTIME_MASK);
}

/**
 *  @brief     Set the HFXT frequency range
 *
 * The high frequency crystal oscillator (HFXT) can be used with standard
 * crystals and resonators in the 4-48MHz range to generate a stable high-speed
 * reference clock for the system.
 *
 *  @param[in]  range  One of @ref DL_SYSCTL_HFXT_RANGE
 */
__STATIC_INLINE void DL_SYSCTL_setHFXTFrequencyRange(
    DL_SYSCTL_HFXT_RANGE range)
{
    DL_Common_updateReg(&SYSCTL->SOCLOCK.HFCLKCLKCFG, ((uint32_t) range),
        SYSCTL_HFCLKCLKCFG_HFXTRSEL_MASK);
}

/**
 *  @brief   Get the HFXT frequency range
 *
 *  @return  Returns the HFXT frequency range
 *
 *  @retval  One of @ref DL_SYSCTL_HFXT_RANGE
 */
__STATIC_INLINE DL_SYSCTL_HFXT_RANGE DL_SYSCTL_getHFXTFrequencyRange(void)
{
    uint32_t range =
        (SYSCTL->SOCLOCK.HFCLKCLKCFG & SYSCTL_HFCLKCLKCFG_HFXTRSEL_MASK) >>
        SYSCTL_HFCLKCLKCFG_HFXTRSEL_OFS;

    return (DL_SYSCTL_HFXT_RANGE)(range);
}

/**
 *  @brief  Enable the HFCLK startup monitor
 *
 * The HFXT takes time to start after being enabled. A startup monitor is
 * provided to indicate to the application software if the HFXT has successfully
 * started, at which point the HFCLK can be selected to source a variety of
 * system functions. The HFCLK startup monitor also supports checking the
 * HFCLK_IN digital clock input for a clock stuck fault.
 *
 */
__STATIC_INLINE void DL_SYSCTL_enableHFCLKStartupMonitor(void)
{
    SYSCTL->SOCLOCK.HFCLKCLKCFG |= SYSCTL_HFCLKCLKCFG_HFCLKFLTCHK_ENABLE;
}

/**
 *  @brief  Disable the HFCLK startup monitor
 */
__STATIC_INLINE void DL_SYSCTL_disableHFCLKStartupMonitor(void)
{
    SYSCTL->SOCLOCK.HFCLKCLKCFG &= ~(SYSCTL_HFCLKCLKCFG_HFCLKFLTCHK_MASK);
}

/**
 *  @brief  Retrieves the calibration constant of the temperature sensor to be
 *          used in temperature calculation.
 *
 *  @retval Temperature sensor calibration data
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getTempCalibrationConstant(void)
{
    return DL_FactoryRegion_getTemperatureVoltage();
}

/**
 *  @brief  Initializes the Read Execute (RX) Protect Firewall
 *
 *  The firewall security configuration can only be configured if INITDONE has
 *  not been issued by the CSC.
 *  This API checks if INITDONE has been issued. If it has not been issued,
 *  then the start and end addresses are set, and then it enables the firewall.
 *  If INITDONE has been issused, then the API immediately returns.
 *
 *  @param[in] startAddr  The start address of the read execute protect firewall
 *  @param[in] endAddr    The end address of the read execute protect firewall
 *
 *  @return  If the Read Execute Protect Firewall was configured
 *
 *  @retval  true  If INITDONE was not issued and the firewall was configured
 *  @retval  false If INITDONE was issued and the firewall was not configured
 */
bool DL_SYSCTL_initReadExecuteProtectFirewall(
    uint32_t startAddr, uint32_t endAddr);

/**
 *  @brief  Initializes the IP Protect Firewall
 *
 *  The firewall security configuration can only be configured if INITDONE has
 *  not been issued by the CSC.
 *  This API checks if INITDONE has been issued. If it has not been issued,
 *  then the start and end addresses are set, and then it enables the firewall.
 *  If INITDONE has been issused, then the API immediately returns.
 *
 *  @param[in] startAddr  The start address of the IP protect firewall
 *  @param[in] endAddr    The end address of the IP protect firewall
 *
 *  @return  If the IP Protect Firewall was configured
 *
 *  @retval  true  If INITDONE was not issued and the firewall was configured
 *  @retval  false If INITDONE was issued and the firewall was not configured
 */
bool DL_SYSCTL_initIPProtectFirewall(uint32_t startAddr, uint32_t endAddr);

/**
 *  @brief  Set the address range of the Write Protect Firewall
 *
 *  Set Write Protection starting at 0x0 of flash, for the first
 *  32KB at 1KB granularity.
 *  Setting a bit to 1 enables write protection, and setting a bit to 0
 *  allows write.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST.
 *
 *  @param[in] addrMask The mask to set the address range for the Write Protect
 *                      Firewall
 */
__STATIC_INLINE void DL_SYSCTL_setWriteProtectFirewallAddrRange(
    uint32_t addrMask)
{
    SYSCTL->SECCFG.FWEPROTMAIN = addrMask;
}

/**
 *  @brief  Get the address range of the Write Protect Firewall
 *
 *  @retval The address range for the Write Protect Firewall
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getWriteProtectFirewallAddrRange(void)
{
    return (SYSCTL->SECCFG.FWEPROTMAIN);
}

/**
 *  @brief  Set the start address of the Read Execute (RX) Protect Firewall
 *
 *  Set the start of the range of Flash MAIN memory that needs to be guarded
 *  from both read and execute accesses. The firewall is configured as an
 *  address range.
 *
 *  The start and end addresses are specified at 64B sector granularity, so
 *  the 6 LSBs are don't cares.
 *  If the start address is equal to the end address, then one sector is RX
 *  protected. If the end address is equal to the start address + 1, then two
 *  sectors are protected, and so on. If the end address is less than the start
 *  address, the no sectors are RX protected. The hardware does not perform any
 *  checks on the addresses.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST.
 *
 *  @param[in] startAddr  The start address of the read execute protect
 *                        firewall. The 6 LSBs are don't cares.
 */
__STATIC_INLINE void DL_SYSCTL_setReadExecuteProtectFirewallAddrStart(
    uint32_t startAddr)
{
    SYSCTL->SECCFG.FRXPROTMAINSTART =
        (startAddr & SYSCTL_FRXPROTMAINSTART_ADDR_MASK);
}

/**
 *  @brief  Get the start address of the Read Execute (RX) Protect Firewall
 *
 *  The start and end addresses are specified at 64B sector granularity, so
 *  the 6 LSBs are don't cares.
 *
 *  @return  The start address of the read execute protect firewall
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getReadExecuteProtectFirewallAddrStart(void)
{
    return (SYSCTL->SECCFG.FRXPROTMAINSTART);
}

/**
 *  @brief  Set the end address of the Read Execute (RX) Protect Firewall
 *
 *  Set the end of the range of Flash MAIN memory that needs to be guarded
 *  from both read and execute accesses. The firewall is configured as an
 *  address range.
 *
 *  The start and end addresses are specified at 64B sector granularity, so
 *  the 6 LSBs are don't cares.
 *  If the start address is equal to the end address, then one sector is RX
 *  protected. If the end address is equal to the start address + 1, then two
 *  sectors are protected, and so on. If the end address is less than the start
 *  address, the no sectors are RX protected. The hardware does not perform any
 *  checks on the addresses.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST.
 *
 *  @param[in] endAddr  The end address of the read execute protect firewall.
 *                      The 6 LSBs are don't cares.
 */
__STATIC_INLINE void DL_SYSCTL_setReadExecuteProtectFirewallAddrEnd(
    uint32_t endAddr)
{
    SYSCTL->SECCFG.FRXPROTMAINEND =
        (endAddr & SYSCTL_FRXPROTMAINEND_ADDR_MASK);
}

/**
 *  @brief  Get the end address of the Read Execute (RX) Protect Firewall
 *
 *  The start and end addresses are specified at 64B sector granularity, so
 *  the 6 LSBs are don't cares.
 *
 *  @return  The end address of the Read Execute Protect Firewall
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getReadExecuteProtectFirewallAddrEnd(void)
{
    return (SYSCTL->SECCFG.FRXPROTMAINEND);
}

/**
 *  @brief  Set the start address of the IP Protect Firewall
 *
 *  Set the end of the range of Flash MAIN memory that needs to be guarded
 *  from read access, allowing only execute accesses. The firewall is configured
 *  as an address range.
 *
 *  The start and end addresses are specified at 64B sector granularity, so
 *  the 6 LSBs are don't cares.
 *  If the start address is equal to the end address, then one sector is IP
 *  protected. If the end address is equal to the start address + 1, then two
 *  sectors are protected, and so on. If the end address is less than the start
 *  address, the no sectors are IP protected. The hardware does not perform any
 *  checks on the addresses.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST.
 *
 *  @param[in] startAddr  The start address of the IP Protect Firewall
 */
__STATIC_INLINE void DL_SYSCTL_setIPProtectFirewallAddrStart(
    uint32_t startAddr)
{
    SYSCTL->SECCFG.FIPPROTMAINSTART =
        (startAddr & SYSCTL_FIPPROTMAINSTART_ADDR_MASK);
}

/**
 *  @brief  Get the start address of the IP Protect Firewall
 *
 *  @return  The start address of the IP Protect Firewall
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getIPProtectFirewallAddrStart(void)
{
    return (SYSCTL->SECCFG.FIPPROTMAINSTART);
}

/**
 *  @brief  Set the end address of the IP Protect firewall
 *
 *  Set the end of the range of Flash MAIN memory that needs to be guarded
 *  from read access, allowing only execute accesses. The firewall is configured
 *  as an address range.
 *
 *  The start and end addresses are specified at 64B sector granularity, so
 *  the 6 LSBs are don't cares.
 *  If the start address is equal to the end address, then one sector is IP
 *  protected. If the end address is equal to the start address + 1, then two
 *  sectors are protected, and so on. If the end address is less than the start
 *  address, the no sectors are IP protected. The hardware does not perform any
 *  checks on the addresses.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST.
 *
 *  @param[in] endAddr  The end address of the IP Protect firewall
 */
__STATIC_INLINE void DL_SYSCTL_setIPProtectFirewallAddrEnd(uint32_t endAddr)
{
    SYSCTL->SECCFG.FIPPROTMAINEND =
        (endAddr & SYSCTL_FIPPROTMAINEND_ADDR_MASK);
}

/**
 *  @brief  Get the end address of the IP Protect Firewall
 *
 *  @return  The end address of the IP Protect Firewall
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getIPProtectFirewallAddrEnd(void)
{
    return (SYSCTL->SECCFG.FIPPROTMAINEND);
}

/**
 *  @brief      Enable Read Execute (RX) Protect Firewall
 *
 *  Enables the Read Execute Protect Firewall before INITDONE.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST
 */
__STATIC_INLINE void DL_SYSCTL_enableReadExecuteProtectFirewall(void)
{
    SYSCTL->SECCFG.FWENABLE |=
        (SYSCTL_FWENABLE_FLRXPROT_ENABLE | SYSCTL_FWENABLE_KEY_VALUE);
}

/**
 *  @brief      Enable IP Protect Firewall
 *
 *  Enables the IP Protect Firewall before INITDONE. After INITDONE,
 *  this configuration gets locked until the next BOOTRST.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST
 */
__STATIC_INLINE void DL_SYSCTL_enableIPProtectFirewall(void)
{
    SYSCTL->SECCFG.FWENABLE |=
        (SYSCTL_SECSTATUS_FLIPPROT_ENABLED | SYSCTL_FWENABLE_KEY_VALUE);
}

/**
 *  @brief      Enable SRAM Boundary Lock
 *
 *  When SRAM Boundary Lock is enabled, the SRAMBOUNDARY register is only
 *  writeable only until INITDONE. After INITDONE, the SRAMBOUNDARY register
 *  cannot be written.
 *
 *  When disabled, the SRAMBOUNDARY register is writeable throughout the
 *  application, even after INITDONE.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST
 *
 *  @sa DL_SYSCTL_setSRAMBoundaryAddress
 */
__STATIC_INLINE void DL_SYSCTL_enableSRAMBoundaryLock(void)
{
    SYSCTL->SECCFG.FWENABLE |=
        (SYSCTL_FWENABLE_SRAMBOUNDARYLOCK_ENABLE | SYSCTL_FWENABLE_KEY_VALUE);
}

/**
 *  @brief  Checks if INITDONE has been issued by the CSC
 *
 *  @return Whether INITDONE has been issued or not
 *
 *  @retval  true  If INITDONE has been issued
 *  @retval  false If INITDONE has not been issued
 */
__STATIC_INLINE bool DL_SYSCTL_isINITDONEIssued(void)
{
    return ((SYSCTL->SECCFG.SECSTATUS & SYSCTL_SECSTATUS_INITDONE_YES) ==
            SYSCTL_SECSTATUS_INITDONE_YES);
}

/**
 *  @brief  Checks if Customer Startup Code (CSC) exists in system
 *
 *  @return Whether CSC exists in system
 *
 *  @retval  true  If CSC exists in system
 *  @retval  false If CSC does not exist in system
 */
__STATIC_INLINE bool DL_SYSCTL_ifCSCExists(void)
{
    return ((SYSCTL->SECCFG.SECSTATUS & SYSCTL_SECSTATUS_CSCEXISTS_YES) ==
            SYSCTL_SECSTATUS_CSCEXISTS_YES);
}

/**
 *  @brief  Checks if Read Execute (RX) Protect Firewall is enabled
 *
 *  @return Whether Read Execute Protect Firewall is enabled
 *
 *  @retval  true  If Read Execute Protect Firewall is enabled
 *  @retval  false If Read Execute Protect Firewall is not enabled
 */
__STATIC_INLINE bool DL_SYSCTL_isReadExecuteProtectFirewallEnabled(void)
{
    return ((SYSCTL->SECCFG.SECSTATUS & SYSCTL_SECSTATUS_FLRXPROT_ENABLED) ==
            SYSCTL_SECSTATUS_FLRXPROT_ENABLED);
}

/**
 *  @brief  Checks if IP Protect Firewall is enabled
 *
 *  @return Whether IP Protect Firewall is enabled
 *
 *  @retval  true  If IP Protect Firewall is enabled
 *  @retval  false If IP Protect Firewall is not enabled
 */
__STATIC_INLINE bool DL_SYSCTL_isIPProtectFirewallEnabled(void)
{
    return ((SYSCTL->SECCFG.SECSTATUS & SYSCTL_SECSTATUS_FLIPPROT_ENABLED) ==
            SYSCTL_SECSTATUS_FLIPPROT_ENABLED);
}

/**
 *  @brief  Checks if SRAM Boundary Lock is enabled
 *
 *  @return Whether SRAM Boundary Lock is enabled
 *
 *  @retval  true  If SRAM Boundary Lock is enabled
 *  @retval  false If SRAM Boundary Lock is not enabled
 */
__STATIC_INLINE bool DL_SYSCTL_isSRAMBoundaryLocked(void)
{
    return ((SYSCTL->SECCFG.SECSTATUS &
                SYSCTL_SECSTATUS_SRAMBOUNDARYLOCK_ENABLED) ==
            SYSCTL_SECSTATUS_SRAMBOUNDARYLOCK_ENABLED);
}

/**
 *  @brief  Indicate that INIT is done
 *
 *  After INITDONE is issued, the security configuration is locked and enforced.
 *  A SYSRST will occur, restarting startup code execution, and the main
 *  application is launched.
 *
 *  There is no hardware support to enforce a timeout if INITDONE is not issued
 *  in a reasonable period of time. It is recommended that the CSC use a
 *  watchdog to ensure that INITDONE is issued in a timely manner.
 */
__STATIC_INLINE void DL_SYSCTL_issueINITDONE(void)
{
    SYSCTL->SECCFG.INITDONE |=
        (SYSCTL_INITDONE_PASS_TRUE | SYSCTL_INITDONE_KEY_VALUE);
}

/**
 *  @brief  Checks if Flash Bank swapping is enabled
 *
 *  @return Whether Flash Bank swap is enabled
 *
 *  @retval  false  This is not a multi-bank device
 */
__STATIC_INLINE bool DL_SYSCTL_isFlashBankSwapEnabled(void)
{
    return false;
}

/**
 *  @brief  Checks if executing from upper flash bank
 *
 *  @return Whether executing from upper flash bank
 *
 *  @retval  false  This is not a multi-bank device.
 */
__STATIC_INLINE bool DL_SYSCTL_isExecuteFromUpperFlashBank(void)
{
    return false;
}

#ifdef __cplusplus
}
#endif

#endif /* ti_dl_m0p_dl_sysctl_sysctl__include */
/** @}*/
